In [1]:
import numpy as np 
import pandas as pd
import seaborn as sns
from matplotlib import pyplot as plt

In [2]:
gro = pd.read_csv('../Datasets/Groceries_dataset.csv')
gro

       Member_number        Date        itemDescription
0               1808  21-07-2015         tropical fruit
1               2552  05-01-2015             whole milk
2               2300  19-09-2015              pip fruit
3               1187  12-12-2015       other vegetables
4               3037  01-02-2015             whole milk
...              ...         ...                    ...
38760           4471  08-10-2014          sliced cheese
38761           2022  23-02-2014                  candy
38762           1097  16-04-2014               cake bar
38763           1510  03-12-2014  fruit/vegetable juice
38764           1521  26-12-2014               cat food

[38765 rows x 3 columns]

In [3]:
print("Date From",gro.Date.min(),'to',gro.Date.max())

Date From 01-01-2014 to 31-10-2015

In [11]:
gro['Date']

0        21-07-2015
1        05-01-2015
2        19-09-2015
3        12-12-2015
4        01-02-2015
            ...
38760    08-10-2014
38761    23-02-2014
38762    16-04-2014
38763    03-12-2014
38764    26-12-2014
Name: Date, Length: 38765, dtype: object

In [12]:
gro.Date.dtypes

dtype('O')

In [14]:
gro['Date']=pd.to_datetime(gro['Date'])
gro.Date

0       2015-07-21
1       2015-05-01
2       2015-09-19
3       2015-12-12
4       2015-01-02
           ...
38760   2014-08-10
38761   2014-02-23
38762   2014-04-16
38763   2014-03-12
38764   2014-12-26
Name: Date, Length: 38765, dtype: datetime64[ns]

In [15]:
gro.Date.dtypes

dtype('<M8[ns]')

In [16]:
gro.Date.dt.year

0        2015
1        2015
2        2015
3        2015
4        2015
         ...
38760    2014
38761    2014
38762    2014
38763    2014
38764    2014
Name: Date, Length: 38765, dtype: int64

In [18]:
gro['year']=gro.Date.dt.year
gro.year

0        2015
1        2015
2        2015
3        2015
4        2015
         ...
38760    2014
38761    2014
38762    2014
38763    2014
38764    2014
Name: year, Length: 38765, dtype: int64

In [20]:
gro['month']=gro.Date.dt.month
gro.month

0         7
1         5
2         9
3        12
4         1
         ..
38760     8
38761     2
38762     4
38763     3
38764    12
Name: month, Length: 38765, dtype: int64

In [21]:
gro['day']=gro.Date.dt.day
gro.day

0        21
1         1
2        19
3        12
4         2
         ..
38760    10
38761    23
38762    16
38763    12
38764    26
Name: day, Length: 38765, dtype: int64

In [22]:
gro['day name']=gro.Date.dt.day_name()
gro['day name']

0          Tuesday
1           Friday
2         Saturday
3         Saturday
4           Friday
           ...
38760       Sunday
38761       Sunday
38762    Wednesday
38763    Wednesday
38764       Friday
Name: day name, Length: 38765, dtype: object

In [24]:
gro.head(10)

   Member_number       Date   itemDescription  year  month  day   day name
0           1808 2015-07-21    tropical fruit  2015      7   21    Tuesday
1           2552 2015-05-01        whole milk  2015      5    1     Friday
2           2300 2015-09-19         pip fruit  2015      9   19   Saturday
3           1187 2015-12-12  other vegetables  2015     12   12   Saturday
4           3037 2015-01-02        whole milk  2015      1    2     Friday
5           4941 2015-02-14        rolls/buns  2015      2   14   Saturday
6           4501 2015-08-05  other vegetables  2015      8    5  Wednesday
7           3803 2015-12-23        pot plants  2015     12   23  Wednesday
8           2762 2015-03-20        whole milk  2015      3   20     Friday
9           4119 2015-12-02    tropical fruit  2015     12    2  Wednesday

In [ ]:
plt.rcparams['figure.figsize']=[17,7]
color=plt.cm.spring_r